"""
## Առաջադրանք 3. Կախարդանք

Ինչ պետք է անել
Խաղի համար անհրաժեշտ է իրականացնել կախարդանքի մեխանիզմ, որտեղ երկու տարրերի միացման արդյունքում ստացվում է նոր տարր։
Մենք ունենք չորս հիմնական տարր՝ «Ջուր», «Օդ», «Կրակ», «Հող»: Նրանցից ստացվում են նորերը՝ «Փոթորիկ», «Գոլորշի», «Կեղտ», «Կայծակ», «Փոշի», «Լավա»:

Պարամետրերը հետևյալն են՝
- Ջուր + Օդ = Փոթորիկ;
- Ջուր + Կրակ = Գոլորշի;
- Ջուր + Հող = Կեղտ;
- Օդ + Կրակ = Կայծակ;
- Օդ + Հող = Փոշի;
- Կրակ + Հող = Լավա։

Գրեք ծրագիր, որը կիրականացնի այս տարրերի փոխակերպումները։ Յուրաքանչյուր տարր պետք է ներկայացվի որպես առանձին դաս։ Եթե արդյունքը սահմանված չէ, վերադարձեք `None`։

Տես՝ https://www.geeksforgeeks.org/operator-overloading-in-python/

Ինչ է գնահատվում
1. Արդյունքը ճիշտ է։
2. Մոդելները իրականացված են օբյեկտային ծրագրավորման ոճում։
"""

class Storm:
    pass

class Water:
    def __add__(self, other):
        if isinstance(other, Air):
            return Storm()
        elif isinstance(other, Fire):
            return Steam()

class Steam:
    pass

class Air:
    pass

class Fire:
    pass

class Grow:
    pass


water = Water()
air = Air()

storm = water + air
print(storm)