"""
## Առաջադրանք 4. Համատեղ ապրել
Ինչ պետք է անել
Արտյոմը որոշել է փորձարկել համատեղ ապրելու գաղափարը՝ հասկանալու համար, թե արժե արդյոք ապրել ինչ-որ մեկի հետ։
Ծրագրում պետք է իրականացնել «Մարդ» և «Տուն» մոդելները:

**Մարդը կարող է**՝
- ուտել (+ կշտություն, − սնունդ);
- աշխատել (− կշտություն, + գումար);
- խաղալ (− կշտություն);
- խանութ գնալ սնունդի համար (+ սնունդ, − գումար);
- ապրել մեկ օր (ընտրում է գործողություն ըստ նկարագրված առաջնահերթության)։

**Մարդու ունի**՝
- անուն,
- կշտության մակարդակ (սկզբնական՝ 50),
- տուն։

**Տունը ունի**՝
- սառնարան սնունդով (սկզբնական՝ 50 սնունդ),
- դարակ գումարով (սկզբնական՝ 0 դրամ)։

Եթե մարդու կշտությունը ընկնում է 0-ից ցածր, նա մահանում է:

**Գործողությունների տրամաբանությունը**՝
1. Գեներացվում է տախտակի թիվ՝ 1-ից 6:
2. Եթե կշտությունը < 20, մարդը պետք է ուտի:
3. Եթե սնունդը < 10 է տանը, մարդը գնում է խանութ։
4. Եթե գումարը տանը < 50 է, նա աշխատում է։
5. Եթե տախտակը ցույց է տալիս 1, մարդը աշխատում է:
6. Եթե տախտակը ցույց է տալիս 2, մարդը ուտում է:
7. Հակառակ դեպքում՝ մարդը խաղում է:

Ծրագիրը պետք է ունենա հնարավորություն՝ մարդու 365 օր ապրելու, և երկու մարդիկ՝ ապրող մեկ տան մեջ:
Ինչ է գնահատվում
1. Արդյունքը ճիշտ է։
2. Մոդելները իրականացված են օբյեկտային ծրագրավորման ոճում։
3. Փոփոխականները, ֆունկցիաները և դասերի մեթոդները ունեն իմաստալից անուններ։
"""

class Human:
    def __init__(self, name):
        self.name = name
        self.feeded_state = 50
        self.house = House()

