"""Առաջադրանք 6. Աբստրակտ դաս
Համատեքստ
Դուք աշխատում եք մի ընկերությունում, որը մշակում է ծրագրակազմ ճարտարապետական ​​նախագծերի համար: Դուք պետք է մշակեք ծրագիր տարբեր երկրաչափական ձևերի տարածքը հաշվարկելու համար, ինչպիսիք են շրջանակները, ուղղանկյունները և եռանկյունները:

Առաջադրանք
Ստեղծել.

Shape դասը, որը կլինի հիմնական դասը բոլոր ձևերի համար և կպահի դատարկ տարածքի մեթոդ, որը ժառանգորդները պետք է անտեսեն.
շրջանի դաս;
Ուղղանկյունի դաս;
Եռանկյունի դաս.
Circle, Rectangle և Triangle դասերը ժառանգում են Shape դասից և իրականացնում են ձևի մակերեսը հաշվարկելու մեթոդ:

Բացի այդ, սովորեք վերացական դասերի հետ աշխատելու մասին:
https://docs-python.ru/tutorial/klassy-jazyke-python/abstraktnye-klassy/
Այս տեղեկատվության հիման վրա կատարեք հետևյալը.

Shape դասի օբյեկտներ ստեղծելն անհնար էր։
Shape-ի հետնորդները անտեսում են իր տարածքի մեթոդը, որպեսզի այդ դասերի օբյեկտները կարողանան օգտագործվել:
"""
