"""Առաջադրանք 3. Ձեր սեփական բառարանը
Ինչ անել
Հանգամանքների բերումով Վասյան անընդհատ ստիպված է աշխատել բառարանների և դրանց տվյալների հետ։ Ներառյալ ստանալ(get) մեթոդը, որը լռելյայնորեն վերադարձնում է None, եթե բառարանում նման բանալի չկա։ Սակայն Վասյային դա չի բավարարում. նորմալ աշխատանքի համար անհրաժեշտ է վերադարձնել 0։

Իրականացրեք MyDict դասը, որը կգործի ճիշտ այնպես, ինչպես սովորական բառարանը (փորձեք այն ժառանգել), բացառությամբ, որ ստացման(get) կանխադրված մեթոդը կվերադարձնի 0 թիվը, այլ ոչ թե None:

Ինչ է գնահատվում
Հաշվարկի արդյունքը ճիշտ է։
Մոդելներն իրականացվում են OOP ոճով, հիմնական ֆունկցիոնալությունը նկարագրված է դասի մեթոդներով և անհատական ​​գործառույթներով:
Արդյունքների ստացման գործընթացի մասին հաղորդագրությունները իմաստալից և հասկանալի են օգտագործողի համար:
Փոփոխականները, ֆունկցիաները և դասերի սեփական մեթոդներն ունեն իմաստալից անուններ, այլ ոչ թե a, b, c, d:
Դասերը և մեթոդները/գործառույթները ունեն գրավոր փաստաթղթեր:
"""
