"""Առաջադրանք 1. Հարկեր
Ինչ անել
Իրականացնել դասերի հիերարխիա, որը նկարագրում է հարկ վճարողի գույքը: Այն պետք է բաղկացած լինի հիմնական դասի Գույքից և դրանից բխող դասերից Բնակարան, Ավտոմեքենա և Գյուղական տուն:

Բազային դասը պետք է ունենա արժեքի հատկանիշ, որը փոխանցվում է կոնստրուկտորին, և ստացված դասերից յուրաքանչյուրում վերացված հարկի հաշվարկման մեթոդ:
Բնակարանի հարկը հաշվարկվում է արժեքի 1/1000, մեքենայի վրա՝ 1/200, ամառանոցինը՝ 1/500։ 

Յուրաքանչյուր երեխա դաս պետք է ունենա մեկ պարամետրով կառուցող(կոնստրուկտոր), որն իր պարամետրը փոխանցում է բազային դասի կոնստրուկտորին:

Մշակել ծրագրի միջերեսը: Թող օգտագործողից հարցնի իր գումարի չափը և գույքի արժեքը, իսկ հետո հարկ վճարի համապատասխան գույքի վրա և ցույց տա, թե որքան գումար է պակասում (եթե դա այդպես է):
"""
